app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`user_id` = 1 AND (Type='Expenses')
---
  def index
  	@categories = Category.search(params,current_user)

INSERT INTO `categories` (`user_id`, `type`, `source`, `entry_date`, `description`, `amount`, `created_at`, `updated_at`) VALUES (1, 'Expenses', 'Groceries', '2015-10-13 00:00:00', '', 3000.0, '2015-10-19 11:13:06', '2015-10-19 11:13:06')
---
	def create
	  @category = Category.new(category_params)
		if @category.save